; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	infrared2 - mode
	spectrograph0 - mode
	spectrograph3 - mode
	infrared1 - mode
	spectrograph4 - mode
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation4 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph4)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared2)
	(supports instrument7 spectrograph3)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
)
(:goal (and
	(pointing satellite1 GroundStation4)
	(pointing satellite2 Star2)
	(have_image Star6 infrared2)
	(have_image Phenomenon7 infrared2)
	(have_image Star8 spectrograph0)
	(have_image Star9 spectrograph4)
	(have_image Star10 spectrograph4)
	(have_image Star11 spectrograph3)
))

)

; plan
1. (turn_to satellite3 groundstation4 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 groundstation4)
   goals met: 1 of 8
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 1 of 8
3. (calibrate satellite3 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 1 of 8
4. (turn_to satellite3 star11 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star11)
   goals met: 1 of 8
5. (take_image satellite3 star11 instrument7 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 2 of 8
6. (turn_to satellite3 star10 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star10)
   goals met: 2 of 8
7. (take_image satellite3 star10 instrument7 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 3 of 8
8. (turn_to satellite3 phenomenon7 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 phenomenon7)
   goals met: 3 of 8
9. (turn_to satellite1 groundstation1 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 8
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 8
11. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 3 of 8
12. (take_image satellite3 phenomenon7 instrument7 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 4 of 8
13. (turn_to satellite1 star8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star8)
   goals met: 4 of 8
14. (take_image satellite1 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 5 of 8
15. (turn_to satellite1 groundstation4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation4)
   goals met: 6 of 8
16. (turn_to satellite3 star6 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star6)
   goals met: 6 of 8
17. (take_image satellite3 star6 instrument7 infrared2)
   added: (have_image star6 infrared2)
   goals met: 7 of 8
18. (turn_to satellite3 star9 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star9)
   goals met: 7 of 8
19. (take_image satellite3 star9 instrument7 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 8 of 8
